cool/tutorials/multiphase/cavitatingFoam/ras/throttle/system/cellSetDict.3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      cellSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

name c0;

action new;

topoSetSources
(
    boxToCell
    {
        box (4.75e-03 -0.375e-03 -1) (9e-03 0.375e-03 1);
    }
);

// ************************************************************************* //
